## Домашнее задание «Библиотека Pandas»

In [207]:
import pandas as pd

### Задание 1
Скачайте с сайта grouplens.org...movielens/ датасет любого размера. Определите, какому фильму было выставлено больше всего оценок 5.0.

In [208]:
# считываем первую таблицу рейтинги
data = pd.read_csv('C:\\Users\\alexander.dubovik\\Documents\\PYDA-38\\NUMP_PAND\\hw\\pandas_hw1\\ml-25m\\ratings.csv')
data.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [210]:
# Ищем рейтинг 5 складываем по movieID и находим 1 элемент
rate_data = data[(data['rating']==5)]['movieId'].value_counts().head(1)
rate_data.head()

318    39553
Name: movieId, dtype: int64

In [212]:
# Нам нужен чистый индекс для поиска по id 
ind = rate_data.index[0]
ind

318

In [213]:
# считываем первую таблицу с названиями фильмов
movies = pd.read_csv('C:\\Users\\alexander.dubovik\\Documents\\PYDA-38\\NUMP_PAND\\hw\\pandas_hw1\\ml-25m\\movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [227]:
# Ищем по индексу название фильма
movies[(movies['movieId'] == ind)]

     movieId                             title       genres
314      318  Shawshank Redemption, The (1994)  Crime|Drama

### Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [277]:
# считываем первую таблицу
data1 = pd.read_csv('C:\\Users\\alexander.dubovik\\Documents\\PYDA-38\\NUMP_PAND\\hw\\pandas_hw1\\power.csv')
data1.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [276]:
# фильтруем по условию задачи
filtering_data = data1[((data1['quantity'] >= 0))
                       &
                       ((data1['country'] == 'Latvia') 
                       | 
                        (data1['country'] == 'Lithuania') 
                       | 
                        (data1['country'] == 'Estonia'))
                       &
                       ((data1['year'] >= 2005)
                        & 
                        (data1['year'] <= 2010))
                       &
                       ((data1['category'] == 4) 
                        | (data1['category'] == 12)
                        |(data1['category'] == 21))]
filtering_data.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

In [275]:
# суммируем по quantity
sum_total = filtering_data['quantity'].sum()
print(f'Cуммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года, составило: {sum_total}')

Cуммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года, составило: 240580.0

### Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
- https://fortrader.org/quotes
- www.finanz.ru...om-vremeni

In [278]:
page_url = 'https://fortrader.org/quotes'

data_table = pd.read_html(page_url)[1]
data_table.head()

,Название,Цена,Изменение,Изменение(%),Обновлено
0,Нефть Brent Курс нефти сегодня,93.43,0.89,0.96,NaN
1,Нефть WTI Цены на нефть WTI,86.24,0.95,1.11,NaN
2,Природный газ Цена на природный газ,6.04,-0.03,-0.41,NaN
3,Кофе,156.00,-10.30,-6.19,NaN
4,Кукуруза,658.00,0.80,0.12,NaN